[
    {
        "id": 1,
        "course_name": "Introduction to C Programming",
        "credit": 3,
        "price": 199.99,
        "course_details": "Introduction to C Programming is fundamental, teaching syntax, logic, and problem-solving crucial for software development and understanding programming concepts.",
        "img": "https://imagizer.imageshack.com/img924/2442/VNm7oF.png"
    },
    {
        "id": 2,
        "course_name": "Introduction to Algorithms",
        "credit": 4,
        "price": 299.99,
        "course_details": "Introduction to Algorithms is fundamental, teaching problem-solving and efficient computation, forming the basis for computer science and problem-solving skills.",
        "img": "https://imagizer.imageshack.com/img923/4611/P40w7w.png"
    },
    {
        "id": 3,
        "course_name": "Introduction to C++ for DSA",
        "credit": 3,
        "price": 199.99,
        "course_details": "Introduction to C++ for DSA is crucial as it provides a strong foundation for data structures and algorithms, enabling efficient problem-solving and software development.",
        "img": "https://imagizer.imageshack.com/img923/3269/udwUet.png"
    },
    {
        "id": 4,
        "course_name": "Basic Data Structures",
        "credit": 3,
        "price": 249.99,
        "course_details": "Basic data structures, like arrays and linked lists, provide the foundation for efficient data organization and retrieval in computer science, enabling algorithm design and problem-solving.",
        "img": "https://imagizer.imageshack.com/img922/2495/I4yn4I.png"
    },
    {
        "id": 5,
        "course_name": "Introduction to OOP Python",
        "credit": 3,
        "price": 199.99,
        "course_details": "A basic introduction to Object-Oriented Programming (OOP) in Python is essential for understanding code organization, reusability, and building complex, maintainable software applications.",
        "img": "https://imagizer.imageshack.com/img924/824/jEGpTZ.png"
    },
    {
        "id": 6,
        "course_name": "Software Engineering",
        "credit": 5,
        "price": 349.99,
        "course_details": "Basic software engineering is essential for developing reliable, maintainable, and scalable software systems. It provides structure, quality control, and methodology for efficient and successful software development.",
        "img": "https://imagizer.imageshack.com/img924/6804/IiXEm4.png"
    },
    {
        "id": 7,
        "course_name": "AWS, Cloud Computing",
        "credit": 3,
        "price": 199.99,
        "course_details": "Basic AWS and cloud computing knowledge empowers businesses to scale, innovate, and enhance efficiency while reducing costs, enabling flexibility, security, and global accessibility in the digital era.",
        "img": "https://imagizer.imageshack.com/img922/1672/5RKP0h.png"
    },
    {
        "id": 8,
        "course_name": "Database (MySQL)",
        "credit": 4,
        "price": 299.99,
        "course_details": "Basic MySQL databases are fundamental for data storage and retrieval in web applications, ensuring data integrity and efficient management, serving as a cornerstone of modern information systems.",
        "img": "https://imagizer.imageshack.com/img924/2096/elbXq4.png"
    },
    {
        "id": 9,
        "course_name": "Problem-Solving Part",
        "credit": 4,
        "price": 249.99,
        "course_details": "Problem-solving is essential in overcoming challenges, making informed decisions, and achieving goals. It fosters critical thinking, innovation, and resilience, enabling progress and success in various aspects of life.",
        "img": "https://imagizer.imageshack.com/img923/7924/Ke7hnw.png"
    }
]